tutorials/rhoSimpleFoamFlamelets/Sandia_COH2N2/system/controlDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application    	    rhoSimpleFoamFlamelets;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             10000;

deltaT              1;

writeControl        adjustableRunTime;

writeInterval       1000;

purgeWrite          0;

writeFormat         binary;

writePrecision      6;

writeCompression    uncompressed;

timeFormat          general;

timePrecision       6;

adjustTimeStep      yes;

maxCo               0.1;

runTimeModifiable   yes;

// ************************************************************************* //
